#!/bin/sh
#--------------------------------------------------------------------
# 汎用変数定義
#--------------------------------------------------------------------
APP_DIR=$(cd $(dirname ${BASH_SOURCE:-$0}); pwd)
APP_NAME=`basename $0`

#--------------------------------------------------------------------
# 個別変数定義
#--------------------------------------------------------------------
# 戻り値初期値
RC=0

# 引数取得
PARAM_LIST="$@"

# ログファイル
LOGFILE=${APP_DIR}/TestScript.log

#--------------------------------------------------------------------
# 個別関数定義(function)
#--------------------------------------------------------------------
fOutputLog () {
	local MSG_STR="$@"

	if [ ! -f ${LOGFILE} ]; then
		touch ${LOGFILE}
	fi
	local E_DATE=`date +"%Y-%m-%d %H:%M:%S.%3N"`
	echo "${E_DATE} : ${MSG_STR}" >>${LOGFILE}
}

#--------------------------------------------------------------------
# メイン処理(main)
#--------------------------------------------------------------------
# ログ出力
fOutputLog "${APP_NAME} (PARAM:[$@]) (PID:$$) Start."

# 必要に応じてここに処理を追加する

# ログ出力
fOutputLog "${APP_NAME} (PARAM:[$@]) (PID:$$) Done."

exit ${RC}


